# -*- coding: utf-8 -*-
"""
Лабораторна робота №2 з курсу "Теорія алгоритмів"
Спеціальність: Інформаційні управляючі системи та технології

МЕТА: 
    Дослідити поведінку алгоритмів сортування методами включення та злиття.
    
ОПИС РОБОТИ:
    В даній роботі досліджуються два методи сортування - метод сортування
    включенням (insertion sort) та метод сортування злиття (merge sort). 
    Відомо, що час роботи алгоритму сортування включенням складає О(n^2), тоді
    як час для алгоритму сортування злиттям - O(n*lg(n)). Це означає, що
    метод злиття працює швидше ніж метод включення для достатньо великих
    розмірностей вхідних даних. Для вхідних даних малої розмірності це 
    може бути не так. Адже, в асимптотичних позначеннях нехтують константами 
    та меншими членами функцій, які, насправді, можуть мати значний вплив при
    невеликих розмірностях входу алгоритму.
    В роботі пропонується визначити розмір вхідних даних, при яких метод
    сортування включенням працює швидше, за метод сортування злиттям.
    
    На основі даних (для яких входів краще використовувати метод включення,
    аніж метод злиття) можна створити, так званий, гібридний метод сортування.
    Ідея його полягає в тому, щоб використовувати як основний метод 
    злиття, проте, коли при рекурсивних викликах процедури сортування для 
    масивів меншої розмірності ця розмірність досягає певної наперед визначеної
    величини, то для таких підзадач використовувати метод сортування включенням.

ЗАВДАННЯ:
    1) Реалізувати алгоритм сортування методом злиття. Для цього написати 
    функцію merge на основі наведеного псевдокоду (див. коментарі до функції).
    
    2) Знайти розмірність вхідних даних, при яких сортування методом включення
    працює швидше за метод злиття. Для цього провести експерименти, підібравши
    значення параметрів у функції compare_ins_and_merge. Відповідь на 
    поставлене питання можна знайти шляхом аналізу графіку порівнянь роботи
    двох алгоритмів (див. виклик фукнції plot_data у кінці функції 
    compare_ins_and_merge). 
    Вказати значення розмірності вхідних даних, після яких метод злиття починає
    працювати швидше за метод включення.
        ВІДПОВІДЬ:
            
    3.1) (На додаткові 2 бали) Реалізувати гібридний алгоритм (функція 
    hybrid_sort), який використовує як базовий метод злиття, але при певних 
    розмірностях підзадач переходить до використання методу включення (див. 
    функцію insertion_sort).
    Вказати значення розмірності підмасиву, для якого у гібридному методі буде
    використовуватись метод включення.
        ВІДПОВІДЬ:
            
    3.2) Порівняти час роботи алгоритмів за методом злиття та гібридним методом. 
    Для цього використати функцію compare_merge_and_hybrid. Зробити висновок
    щодо отриманих результатів.
    
ДОКУМЕНТАЦІЯ:
    Python v2.7.3 documentation:
        - http://docs.python.org/2/
        - http://oim.asu.kpi.ua/python/docs (дзеркало, доступне з кафедральних комп'ютерів)
    Книга "Dive Into Python":
        - http://www.diveintopython.net/
        - http://oim.asu.kpi.ua/python/diveintopython/html/ (дзеркало, доступне з кафедральних комп'ютерів)

"""

import random
from plot_data import plot_data
from copy import deepcopy
import time

def generate_data(n, gen_type="random"):
    """
    Функція генерації масивів для подальшого сортування.
    Параметри:
        n (int) - кількість елементів масиву
        gen_type (string) - тип згенерованих даних:
            "best" - відсортований масив (мінімальний час для сортування)
            "worst" - найгірший варіант для сортування
            "random" - послідовність елементів генерується випадкова 
                        (значення за замовчуванням)
                        
    Повертає:
        Масив (list) довжиною n з елементами від 1 до n
    """
    if gen_type=="best":
        a = [i+1 for i in range(n)]
        return a
    elif gen_type=="worst":
        a = [i+1 for i in reversed(range(n))]
        return a
    else:
        a = [i+1 for i in range(n)]
        random.shuffle(a)
        return a
        
def insertion_sort(seq, p, r):
    """
    Алгоритм сортування методом включення.
    Відсортовує підмасив seq[p..r-1].
    Параметри:
        seq - послідовність для сортування
        p - початковий індекс підмасиву
        r - кінцевий індекс підмасиву (границя не включається у підмасив)
    """
    for i in range(p+1, r):
        j = i-1 
        key = seq[i]
        while (seq[j] > key) and (j >= p):
            seq[j+1] = seq[j]
            j -= 1
        seq[j+1] = key
        
def merge_sort(L,begin,end):
    if len(L) < 2:
        return L[:]
    else:
        middle = int((end-begin+1)/2+begin)
        left = merge_sort(L[begin:middle],0,len(L[begin:middle])-1)
        right = merge_sort(L[middle:end+1],0,len(L[middle:end+1])-1)
        result = []
        i, j = 0, 0
        while i < len(left) and j < len(right):
            if left[i]<right[j]:
                result.append(left[i])
                i += 1
            else:
                result.append(right[j])
                j += 1
        while i < len(left):
            result.append(left[i])
            i += 1
        while j < len(right):
            result.append(right[j])
            j += 1
        return result
    
def hybrid_sort(seq, p, r):
    """
    Гібридний алгоритм сортування, який об'єднує методи сортування злиттям та 
    включенням. Ідея полягає у використанні методу злиття, але при досягненні
    певного розміру задачі використовувати метод включення (для задач малої 
    розмірності). Відсортовує підмасив seq[p..r-1].
    
    Параметри:
        seq - послідовність для сортування
        p - початковий індекс підмасиву
        r - кінцевий індекс підмасиву (границя не включається у підмасив)
    """
    
def test(f, data):
    """
    Функція тестування різних алгоритмів сортування в рамках даної лабораторної
    роботи. Підраховує час виконання одного сортування для масиву фіксованої
    довжини.
    Параметри:
        f - функція сортування, яка сама на вхід приймає три параметри:
            seq - масив для сортування
            p - початковий індекс підмасиву
            r - кінцевий індекс підмасиву
        data - список масивів для сортування. Масив data містить декілька 
            тестових масивів і процедура test викликає тестовий алгоритм
            для кожного з тествих підмасивів
    Повертає:
        час роботи алгоритму f на одному екземплярі (у секундах, тип float) 
    """
    repeats = len(data)
    start = time.clock()
    for i in range(repeats):
        # тут можна вивести поточну вхідну послідовність для сортування
        #print data[i]
        f(data[i], 0, len(data[i]))
        # тут можна вивести поточну відсортовану послідовність
        #print data[i], '\n'
    end = time.clock()
    return (end-start)/repeats
    
def compare_ins_and_merge():
    """
    Процедура порівняння двох методів сортування: включенням та злиттям.
    Порівння алгоритмів ґрунтуєься на дослідженні часу їх роботи (в сек). Для
    цього використовується функція test. 
    Тестування проводиться на задачах різної розмірності: від n_begin до n_end
    з кроком n_step (значення цих параметрів встановлюються в середині процедури)
    Для кожної розмірності генерується repeats екземплярів задачі. При чому 
    обидва алгоритми запускаються на одних і тих самих екземплярах задачі.
    """
    
    # параметри для проведення експерименту
    repeats = 1000      # кількість запусків для однієї розмірності
    n_begin = 1         # початкова розмірність задачі
    n_end   = 10        # кінцева розмірність задачі
    n_step  = 1         # крок розмірності
    
    types = ["random"]
    data_plot = {'random': {'insertion':{}, 'merge':{}}}
    data_plot_2 = {'ratio': {'insertion/merge':{}}}
    for n in range(n_begin,n_end+1,n_step):
        print ("\nDATA SIZE: ", n)
        
        for gen_type in types:
            # згенерувати тестові набори даних розмірності n в кількості repeats
            data = [generate_data(n) for i in range(repeats)]
            
            t_insertion = test(insertion_sort , deepcopy(data))
            print ("Insertion time for size", n, ":", t_insertion)
            data_plot[gen_type]['insertion'][n] = t_insertion
            
            t_merge = test(merge_sort, deepcopy(data))
            print ("Merge time for size", n, ":", t_merge)
            data_plot[gen_type]['merge'][n] = t_merge
            
            print ("Ratio insertion/merge:", t_insertion/t_merge)
            data_plot_2['ratio']['insertion/merge'][n] = t_insertion/t_merge
                        
    # побудувати графіки швидкості роботи алгоритмів
    #plot_data(data_plot, logarithmic=False, oneplot=True, data_2=data_plot_2)
    
def compare_merge_and_hybrid():
    """
    Процедура порівняння двох методів сортування: злиттям та гібридного,
    який ґрунтується на методах включення та злиття.
    Детальніше - див. функцію compare_ins_and_merge()
    """
    # параметри для проведення експерименту
    repeats = 10        # кількість запусків для однієї розмірності
    n_begin = 100       # початкова розмірність задачі
    n_end   = 3000      # кінцева розмірність задачі
    n_step  = 100       # крок розмірності
    
    types = ["random"]
    data_plot = {'random': {'merge':{}, 'hybrid':{}}}
    data_plot_2 = {'ratio': {'merge/hybrid':{}}}
    for n in range(n_begin,n_end+1,n_step):
        print ("\nDATA SIZE: ", n)
        
        for gen_type in types:
            data = [generate_data(n) for i in range(repeats)]
            
            t_merge = test(merge_sort, deepcopy(data))
            print ("Merge time for size", n, ":", t_merge)
            data_plot[gen_type]['merge'][n] = t_merge
            
            t_hybrid = test(hybrid_sort, deepcopy(data))
            print ("Hybrid time for size", n, ":", t_hybrid)
            data_plot[gen_type]['hybrid'][n] = t_hybrid
            
            print ("Ratio merge/hybrid:", t_merge/t_hybrid)
            data_plot_2['ratio']['merge/hybrid'][n] = t_merge/t_hybrid
            
    # побудувати графіки швидкості роботи алгоритмів    
    #plot_data(data_plot, logarithmic=False, oneplot=True, data_2=data_plot_2)

"""    
Порівняння алгоритмів сортування за методом включенння та методом злиття.
"""
compare_ins_and_merge()

"""    
Порівняння алгоритмів сортування за методом злиття та гібридного методу,
із використанням методів включення та злиття.
"""
#compare_merge_and_hybrid()